Revit 2027 API
BoundaryConditions.SetCurve Method
 Sets the curve that defines geometry of the line boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCurve(
	Curve curve
)
Public Sub SetCurve (
	curve As Curve
)
public:
void SetCurve(
	Curve^ curve
)
member SetCurve :
        curve : Curve -> unit
Parameters
curve Curve
Exceptions
Exception | Condition
ArgumentException |  The input curve is not bound.
ArgumentNullException |  A non-optional argument was null
InvalidObjectException |  Boundary condition is not a BoundaryConditionsType::Line type.
InvalidOperationException |  This BoundaryConditions is not a hosted object. -or- This BoundaryConditions is constrained on host.
Remarks
 This method works for boundary conditions which are not constrained to their host. This method works with hosted line boundary conditions only. The curve must be bounded.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace